src/AccumulationRegisters/НаличныеРасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>НаличныеРасчеты</Name>
			<Comment>Блок учета наличных расчетов</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма наличной оплаты в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Comment>Индивидуальный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяФормаСобственности</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Обособленное подразделение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/AccumulationRegisters/НаличныеРасчеты/Ext/RecordSetModule.bsl
// Модуль набора записей регистра "Наличные расчеты"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем ДокументОбъект Экспорт; // документ объект
Перем Контрагент Экспорт;                // контрагент
Перем ДоговорВзаиморасчетов Экспорт;	// договор взаиморасчетов с контрагентом
Перем СуммаНаличными Экспорт;			// сумма наличных в валюте договора
Перем РежимПроведения Экспорт;		// Режим проведения документа оперативный/неоперативный
Перем РежимРасходаСредств Экспорт; // установленный режим расход средств 

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Формирует движения по приходу (поступление наличных средств)
// Возвращаемое значение: Булево. Истина - все ОК, Ложь - чего-то не так.
//
Функция Приход() Экспорт
	
	Результат = Истина;
	
	// Сумма наличными должны быть в валюте договора
	ВалютаДоговора	= ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДоговора, ДокументОбъект.Дата);
	КурсДоговора        = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	
	ВалютаДокумента	= ДокументОбъект.ВалютаДокумента;
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДокументОбъект.Дата);
	КурсДокумента = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		
	СуммаНаличными = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаНаличными,ВалютаДокумента,КурсДокумента,ВалютаДоговора,КурсДоговора);
	Если РежимРасходаСредств Тогда
		СуммаНаличными = -СуммаНаличными;
	КонецЕсли;
	СуммаНаличнымиРуб = 0;

	// Наличные расчеты между участниками наличных расчетов в рамках одного договора не могут превышать 100 000 рублей,
	// по указанию Банка России от 07.10.2013 N 3073-У "Об осуществлении наличных расчетов".
	Если НЕ Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо И ПравоПользователя("КонтрольЛимитаНаличныхОплатПоДоговору") И НЕ ПолучитьЗначениеПараметраСтруктуры(ДокументОбъект.ДополнительныеСвойства, "ЭтоВосстановлениеПоследовательностей", Ложь) Тогда
		
		ВалютаБаз      = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаБаз, ДокументОбъект.Дата);
		КурсБаз        = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НаличныеРасчетыОбороты.СуммаОборот КАК СуммаОборот
		               |ИЗ
		               |	РегистрНакопления.НаличныеРасчеты.Обороты КАК НаличныеРасчетыОбороты
		               |ГДЕ
		               |	НаличныеРасчетыОбороты.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов";
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов",ДоговорВзаиморасчетов);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СуммаНаличнымиРуб = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(Выборка.СуммаОборот + СуммаНаличными,ВалютаДоговора,КурсДоговора,ВалютаБаз,КурсБаз,РежимОкругления.Окр15как20);
			ПредельныйРазмерНаличныхРасчетов = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.ПредельныйРазмерНаличныхРасчетов,,ДокументОбъект.Дата);
			Если СуммаНаличнымиРуб > ПредельныйРазмерНаличныхРасчетов ИЛИ СуммаНаличнымиРуб < -ПредельныйРазмерНаличныхРасчетов  Тогда
				СуммаНаличнымиРуб = ?(СуммаНаличнымиРуб<0, -СуммаНаличнымиРуб,СуммаНаличнымиРуб);
				ВывестиСообщение(НСтр("ru = 'Превышен предельный размер наличных расчетов на'") + " " + (СуммаНаличнымиРуб-ПредельныйРазмерНаличныхРасчетов) + " " + Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить().Наименование, ДокументОбъект);
				Результат = Ложь;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	// Приходуем наличные средства
	НоваяЗапись	= Добавить();
	НоваяЗапись.Период				= ДокументОбъект.Дата;
	НоваяЗапись.Регистратор			= ДокументОбъект.Ссылка;
	НоваяЗапись.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
	НоваяЗапись.Сумма 		= Окр(СуммаНаличными,2);
	
	ВалютаБаз      = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаБаз, ДокументОбъект.Дата);
	КурсБаз        = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	НоваяЗапись.СуммаРег = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НоваяЗапись.Сумма,ВалютаДоговора,КурсДоговора,ВалютаБаз,КурсБаз,РежимОкругления.Окр15как20);
	
	// Определяемся с хоз. операцией
	НоваяЗапись.ХозОперация			= ДокументОбъект.ХозОперация;
	
	// Убиваем циклическую ссылку
	ДокументОбъект	= Неопределено;
		
	Возврат Результат;
КонецФункции


#Область Инициализация

РежимПроведения = НЕОПРЕДЕЛЕНО;
СуммаНаличными = 0;
РежимРасходаСредств = Ложь;

#КонецОбласти

#КонецЕсли
